Revit 2027 API
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures.AimErrEmptyName Property
 MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AimErrEmptyName { get; }
Public Shared ReadOnly Property AimErrEmptyName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AimErrEmptyName {
	FailureDefinitionId^ get ();
}
static member AimErrEmptyName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Class
Autodesk.Revit.DB Namespace